---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarBarType.CreateDefaultRebarBarType(Autodesk.Revit.DB.Document)
source: html/be1c7098-bae0-2681-dea7-b081ce1bc698.htm
---
# Autodesk.Revit.DB.Structure.RebarBarType.CreateDefaultRebarBarType Method

Creates a new RebarBarType object with a default name.

## Syntax (C#)
```csharp
public static ElementId CreateDefaultRebarBarType(
	Document ADoc
)
```

## Parameters
- **ADoc** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The newly created type id.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null